import React from "react";
import NavBarHome from "../components/home/NavBarHome";
import Footer from "../components/home/Footer";
import blog from "../assets/blog.svg";
interface Blogs {
  id: number;
  title: string;
  description: string;
  image: string;
}
const Blogs = () => {
  const blogs: Blogs = [
    {
      id: 1,
      title: "نکته طلایی برای عکاسی حرفه‌ای با موبایل",
      description:
        "بسیاری از افراد تصور می‌کنند برای گرفتن عکس‌های حرفه‌ای حتماً باید یک دوربین گران‌قیمت داشته باشند، اما حقیقت این است که با رعایت چند نکته ساده می‌توان با موبایل هم عکس‌هایی خیره‌کننده ثبت کرد. در این مقاله، به مواردی مانند تنظیم نور، استفاده از خطوط راهنما (grid)، انتخاب بهترین زاویه، استفاده از حالت HDR و اپلیکیشن‌های ویرایش حرفه‌ای می‌پردازیم تا بتوانی با موبایل، عکس‌هایی در حد دوربین‌های حرفه‌ای بگیری.",
      image: blog,
    },
    {
      id: 2,
      title: "نکته طلایی برای عکاسی حرفه‌ای با موبایل",
      description:
        "بسیاری از افراد تصور می‌کنند برای گرفتن عکس‌های حرفه‌ای حتماً باید یک دوربین گران‌قیمت داشته باشند، اما حقیقت این است که با رعایت چند نکته ساده می‌توان با موبایل هم عکس‌هایی خیره‌کننده ثبت کرد. در این مقاله، به مواردی مانند تنظیم نور، استفاده از خطوط راهنما (grid)، انتخاب بهترین زاویه، استفاده از حالت HDR و اپلیکیشن‌های ویرایش حرفه‌ای می‌پردازیم تا بتوانی با موبایل، عکس‌هایی در حد دوربین‌های حرفه‌ای بگیری.",
      image: blog,
    },
    {
      id: 3,
      title: "نکته طلایی برای عکاسی حرفه‌ای با موبایل",
      description:
        "بسیاری از افراد تصور می‌کنند برای گرفتن عکس‌های حرفه‌ای حتماً باید یک دوربین گران‌قیمت داشته باشند، اما حقیقت این است که با رعایت چند نکته ساده می‌توان با موبایل هم عکس‌هایی خیره‌کننده ثبت کرد. در این مقاله، به مواردی مانند تنظیم نور، استفاده از خطوط راهنما (grid)، انتخاب بهترین زاویه، استفاده از حالت HDR و اپلیکیشن‌های ویرایش حرفه‌ای می‌پردازیم تا بتوانی با موبایل، عکس‌هایی در حد دوربین‌های حرفه‌ای بگیری.",
      image: blog,
    },
    {
      id: 4,
      title: "نکته طلایی برای عکاسی حرفه‌ای با موبایل",
      description:
        "بسیاری از افراد تصور می‌کنند برای گرفتن عکس‌های حرفه‌ای حتماً باید یک دوربین گران‌قیمت داشته باشند، اما حقیقت این است که با رعایت چند نکته ساده می‌توان با موبایل هم عکس‌هایی خیره‌کننده ثبت کرد. در این مقاله، به مواردی مانند تنظیم نور، استفاده از خطوط راهنما (grid)، انتخاب بهترین زاویه، استفاده از حالت HDR و اپلیکیشن‌های ویرایش حرفه‌ای می‌پردازیم تا بتوانی با موبایل، عکس‌هایی در حد دوربین‌های حرفه‌ای بگیری.",
      image: blog,
    },
  ];
  return (
    <div className="bg-[#1D1818] min-h-screen text-white">
      <NavBarHome />
      <div className="w-11/12 mx-auto flex flex-col gap-12 my-12">
        {blogs.map((blog , index:number) => (
          <div className={`flex flex-col md:flex-row gap-6 ${index % 2 === 0 ? "md:flex-row" : "md:flex-row-reverse"}`} key={blog.id}>
            <img
              className="w-full h-[230px] md:h-[315px] object-cover rounded-md md:w-6/12"
              src={blog.image}
              alt="image"
            />
            <div className="flex flex-col gap-6 md:w-6/12 md:h-[315px] leading-7 md:leading-10 overflow-hidden">
              <h3 className="font-semibold">{blog.title}</h3>
              <p>{blog.description}</p>
            </div>
          </div>
        ))}
      </div>
      <Footer />
    </div>
  );
};

export default Blogs;
